
[
  {
    "id": "1",
    "header": "Complete The Look",
    "subheader": "Ralph Lauren Corp | Cart and Wardrobe Recommendation Experience (Project 1)",
    "image": ["/dominik.neal.io/assets/project1/p1_1.png","/dominik.neal.io/assets/project1/p1_2.png", "/dominik.neal.io/assets/project1/p1_3.png"],
    "skills": ["Roadmapping", "JIRA", "Discovery"],
    "kpis": ["Average Order Value (AOV)", "Conversion Rate", "Bounce Rate", "Session Metric"],
    "overview": "Ralph Lauren in a global luxury retail brand that caters to customers who love vintage-style clothing and timeless fashion. The company offers consumers an assortment of experiences for them to make sound decisions on their purchases whether it’s for a formal event or casual wear. ",
    "software": ["Web/Mobile Development", "Monetate", "Salesforce Commerce Cloud (SFCC)", "Adobe Analytics", "CDP"],
    "strategy": "An element that sets Ralph Lauren a part from its’ competitors is their ability to personalize recommendations based on consumer’s profiles, their history, and what they’ve clicked. Using this and more research, we created an experience that helps consumers complete their look by recommending items that fit the item they want to purchase. This recommendation was used to give the consumer options to prepare an outfit for their upcoming occasion. ",
    "learning": "Before launching, we ran this experience as an AB test on a 50/50 split for a specific timeframe. We were able to understand where consumers were clicking, where they were expecting an action to happen, and how it affected the consumer’s purchase behaviour. This test was launched in North America and generated $30 Million+ in annualized revenue."
    },
    {
      "id": "2",
      "header": "Holidays Shopping Quiz",
      "subheader": "Ralph Lauren Corp | Home Page Placement (Project 2)",
      "image": ["/dominik.neal.io/assets/project2/p2_1.png","/dominik.neal.io/assets/project2/p2_2.png", "/dominik.neal.io/assets/project2/p2_3.png", "/dominik.neal.io/assets/project2/p2_4.png"],
      "video": "path/to/video2.mp4",
      "skills": ["Roadmapping", "JIRA", "Discovery", "Wire-framing", "Global Stakeholder Alignment"],
      "kpis": ["Average Order Value (AOV)", "Conversion Rate", "Bounce Rate", "Session Metric"],
      "overview": "Ralph Lauren in a global luxury retail brand that caters to customers who love vintage-style clothing and timeless fashion. The company offers consumers an assortment of experiences for them to make sound decisions on their purchases whether it’s for a formal event or casual wear.",
      "software": ["Web/Mobile Development", "Monetate", "Salesforce Commerce Cloud (SFCC)", "Adobe Analytics", "CDP"],
      "strategy": "Q4 is the busiest times of the year for Retail companies such as Ralph Lauren. We wanted to capitalize on that to close out the fiscal year. We created a seasonal experience for consumers who are looking to purchase items for themselves and/or others. Consumers are asked a series of questions from who is this item for, how big of a gesture would you like to make, and more. Based on those answers, they were shown a list of products that met those needs.",
      "learning": "This was a global experience launched in NA, EMEA, and APAC so it was necessary to have all of the global stakeholders aligned. APAC’s consumers were an interesting use case. With the region being a large as it is, it overlaps the equator. We were able to provide the same cold climate products on the PLP for northern APAC but for Australia specifically, we had to manipulate Data Lake and SFCC to feed spring and summer climate products to the PLP for consumers in that country. This experience ran from October to early January and generated $1.5 million in revenue in all regions combined."
    },
    {
      "id": "3",
      "header": "Style Quiz, Personalization",
      "subheader": "Ralph Lauren Corp | Home Page Placement (Project 3)",
      "image": ["/dominik.neal.io/assets/project3/p3_1.png","/dominik.neal.io/assets/project3/p3_2.png", "/dominik.neal.io/assets/project3/p3_3.png", "/dominik.neal.io/assets/project3/p3_4.png"],
      "video": "path/to/video2.mp4",
      "skills": ["Roadmapping", "Wire-framing", "Requirement Gathering/writing"],
      "kpis": ["Average Order Value (AOV)", "Conversion Rate", "Customer Retention Rate (CRR)"],
      "overview": "Ralph Lauren in a global luxury retail brand that caters to customers who love vintage-style clothing and timeless fashion. The company offers consumers an assortment of experiences for them to make sound decisions on their purchases whether it’s for a formal event or casual wear.",
      "software": ["Web/Mobile Development", "Data Lake", "Salesforce Commerce Cloud (SFCC)", "Figma"],
      "strategy": "The Personalization team is one of the pillars of the consumer experience at Ralph Lauren. The Style Quiz has been a stable for consumers for years and we made some additions. The Style Quiz allows consumers make selections based on their favorite Ralph Lauren brands, Interests (outside of shopping), gender, and more. After the consumer makes a selection, they are brought to the Style Quiz results page with curated products that they can purchase. We added an option for Kids and Babies into the quiz so consumers can have a list of children’s clothes recommended to them on the results page.",
      "learning": "There was a large LOE while preparing and launching this enhancement to the experience because Kid’s and Baby clothing are more meticulous than Men and Women clothing. This is due to sizing. We had to comb through multiple use cases because we didn’t want the bounce rate to increase due to the length of the quiz. If customers select Kids and Baby instead of just Kids, for example, then they would be met with two extra pages to select the sizing for what they are looking for. We thought of different ways to keep the consumer’s attention and we were successful with the launch."
    },
    {
      "id": "4",
      "header": "Chat & Purchase Experience",
      "subheader": "Neiman Marcus Group  | Mobile App (Project 4",
      "video": ["/dominik.neal.io/assets/project4/p4_1.mov","/dominik.neal.io/assets/project4/p4_2.mov"],
      "skills": ["Wire-framing", "Requirement Gathering/writing", "Vendor Services (Budgeting)"],
      "kpis": ["Conversion Rate", "Customer Retention Rate (CRR)"],
      "overview": "Neiman Marcus is a luxury retail brand that caters to customers who are drawn to high-end fashion. The company works with multiple designer brands to properly display their products, facilitate in-store pop-up shops, and allows consumers to build relationships with their Stylists.",
      "software": ["Twilio", "CommsHub (Microsoft)", "Data Haiku"],
      "strategy": "Neiman Marcus was building a new mobile app for their Tiered Customers during COVID-19. These customers fell in a spend threshold of $10,000-50,000+ a year and the company wanted to figure out a way to get those Tiered customers to continue spending. Given this was during COVID-19, the brick and mortars were closed for the foreseeable future. I lead the Chat experience and needed to figure out a way to get customers connected with their Stylists to make purchases from home because the in-store stylists still needed to be paid commission. This involved researching vendors that focused on chat communication and would allow for purchase to be made via a link within the chat experience.",
      "learning": "This was a pretty difficult experience to launch because there was a lot of in-house development needed for this in-chat link to work for the Stylist’s work stations. There was a POS in-store tool already viable but it was not able to be fully integrated with the Mobile App so there was quite a bit of tech debt involved. In the end, I was able to successfully launch the experience giving the consumer the opportunity to share products from the PDP through Chat to a Stylist, and the Stylist was able to manipulate the products that were sent to make outfits and different styles for the consumer. The consumer was then able to make the purchase within Chat and revive their order confirmation."
    }
]
